{
    "otherSkills": [
        {
            "title": "Pubic Cloud Provider",
            "icon": "<i class=\"fa-solid fa-cloud\"></i>",
            "description": "Erfahrungen mit Anbietern von Public Cloud Services.",
            "createModal": true,
            "details": {
                "Amazon Web Services": [
                    {
                        "type": "Simple Storage Service (S3)",
                        "description": "Ein skalierbarer Cloud-Speicherdienst, der es Benutzern ermöglicht, Daten und Objekte sicher zu speichern und abzurufen."
                    },
                    {
                        "type": "Elastic Compute Cloud (EC2)",
                        "description": "Ein skalierbarer Cloud-Computing-Dienst, der virtuelle Serverinstanzen bereitstellt, um Anwendungen auszuführen, die Computing-Ressourcen erfordern."
                    },
                    {
                        "type": "Relational Database Service (RDS)",
                        "description": "Ein verwalteter Dienst, der das Einrichten, Betreiben und Skalieren von relationalen Datenbanken in der Cloud erleichtert, wie z.B. MySQL, PostgreSQL, Oracle oder SQL Server."
                    },
                    {
                        "type": "Virtual Private Cloud (VPC)",
                        "description": "Ein isoliertes Netzwerk in der AWS-Cloud, das es Benutzern ermöglicht, Ressourcen wie EC2-Instanzen in einer definierten, privaten Umgebung zu betreiben."
                    },
                    {
                        "type": "Elastic Beanstalk",
                        "description": "Ein Dienst, der die Bereitstellung und Skalierung von Webanwendungen und -diensten vereinfacht, indem er automatisch Ressourcen wie EC2-Instanzen, Load Balancer und Skalierungsgruppen verwaltet."
                    },
                    {
                        "type": "Identity Access Management (IAM)",
                        "description": "Ein Dienst zur Verwaltung von Benutzerzugriffen und Berechtigungen in AWS, der es Administratoren ermöglicht, Benutzer, Gruppen und Richtlinien zur Steuerung des Zugriffs auf AWS-Ressourcen zu verwalten."
                    },
                    {
                        "type": "Lambda",
                        "description": "Ein serverloser Computing-Dienst, mit dem Entwickler Code ausführen können, ohne sich um die Bereitstellung oder Verwaltung von Servern kümmern zu müssen. Es ermöglicht die Ausführung von Code in Reaktion auf Ereignisse oder Anforderungen, die von anderen AWS-Services ausgelöst werden."
                    }
                ],
                "Google Cloud Platform": [
                    {
                        "type": "Compute Engine",
                        "description": "Ein skalierbarer und flexibler Dienst zum Erstellen und Verwalten von virtuellen Maschinen (VMs), die auf der Infrastruktur von Google laufen. Compute Engine bietet Hochleistungs-VMs mit branchenführender Preis-Leistung und globaler Verfügbarkeit."
                    }
                ],
                "Microsoft Azure": [
                    {
                        "type": "Linux Virtual Machines",
                        "description": "Azure bietet eine Vielzahl von Linux-VMs, die flexibel und skalierbar sind. Benutzer können aus verschiedenen Linux-Distributionen wählen und die VMs nach Bedarf anpassen."
                    },
                    {
                        "type": "Virtual Machines",
                        "description": "Neben Linux-VMs bietet Azure auch eine breite Palette von Windows-VMs. Diese VMs können für verschiedene Zwecke wie Entwicklung, Tests und Produktion eingesetzt werden."
                    },
                    {
                        "type": "Static Web Apps",
                        "description": "Ein Dienst zum Hosting von statischen Webanwendungen und Websites in Azure. Entwickler können ihre Anwendungen einfach bereitstellen und verwalten, ohne sich um die Infrastruktur kümmern zu müssen."
                    },
                    {
                        "type": "Functions",
                        "description": "Azure Functions ist ein serverloser Dienst, mit dem Entwickler Code ausführen können, der auf Ereignissen oder Anforderungen basiert, ohne sich um die zugrunde liegende Infrastruktur kümmern zu müssen. Entwickler können Funktionen in verschiedenen Programmiersprachen schreiben und sie nahtlos in ihre Anwendungen integrieren."
                    }
                ]
            }
        },
        {
            "title": "Virtualisierung",
            "icon": "<i class=\"fa-solid fa-box\"></i>",
            "description": "Erfahrungen mit Type 1 & 2 Hypervisoren sowie Container-Technologien.",
            "createModal": true,
            "details": {
                "Type 1 Hypervisor": [
                    {
                        "type": "VMware ESXi",
                        "description": "Ein Hypervisor, der direkt auf physischer Hardware läuft und mehrere virtuelle Maschinen hosten kann."
                    },
                    {
                        "type": "Proxmox (unter Verwendung von KVM)",
                        "description": "Eine Open-Source-Virtualisierungsplattform, die auf Linux basiert und KVM nutzt."
                    }
                ],
                "Type 2 Hypervisor": [
                    {
                        "type": "VMware Workstation",
                        "description": "Desktop-Virtualisierungssoftware für die Ausführung von VMs auf einem Host-Betriebssystem."
                    },
                    {
                        "type": "VirtualBox",
                        "description": "Kostenlose Virtualisierungssoftware für die Ausführung von VMs auf einem Host-Betriebssystem."
                    }
                ],
                "Container Software": [
                    {
                        "type": "Docker",
                        "description": "Eine Container-Plattform für die Verpackung und Ausführung von Anwendungen und ihren Abhängigkeiten."
                    },
                    {
                        "type": "Docker Swarm",
                        "description": "Ein Orchestrierungstool für die Verwaltung von Docker-Containerclustern."
                    },
                    {
                        "type": "Kubernetes",
                        "description": "Ein Open-Source-Orchestrierungssystem für die Automatisierung der Containerbereitstellung und -verwaltung."
                    }
                ]
            }
        },
        {
            "title": "Betriebssysteme",
            "icon": "<i class=\"fa-solid fa-desktop\"></i>",
            "description": "Die Betriebssysteme, mit denen ich bisher Erfahrungen gesammelt habe.",
            "createModal": true,
            "details": {
                "Windows": [
                    {
                        "type": "Windows 7",
                        "description": "Ein von Microsoft entwickeltes Betriebssystem, das weit verbreitet war und viele Jahre lang genutzt wurde."
                    },
                    {
                        "type": "Windows 8",
                        "description": "Eine Version von Microsoft Windows mit einem neu gestalteten Benutzeroberflächenkonzept, das speziell für Touchscreens optimiert wurde."
                    },
                    {
                        "type": "Windows 10",
                        "description": "Das aktuelle Betriebssystem von Microsoft, das eine Vielzahl von Funktionen und Verbesserungen im Vergleich zu seinen Vorgängern bietet."
                    },
                    {
                        "type": "Windows 11",
                        "description": "Die neueste Version von Microsoft Windows mit aktualisiertem Design und neuen Funktionen."
                    },
                    {
                        "type": "Windows Server 2012",
                        "description": "Eine Serverversion von Microsoft Windows, die speziell für den Einsatz in Unternehmensumgebungen entwickelt wurde."
                    },
                    {
                        "type": "Windows Server 2016",
                        "description": "Eine weitere Serverversion von Microsoft Windows mit verbesserten Funktionen für die Unternehmensnutzung."
                    },
                    {
                        "type": "Windows Server 2019",
                        "description": "Die aktuellste Serverversion von Microsoft Windows mit erweiterten Funktionen für Unternehmen und Cloud-Integration."
                    }
                ],
                "Linux": [
                    {
                        "type": "Ubuntu",
                        "description": "Eine beliebte Linux-Distribution, die für ihre Benutzerfreundlichkeit und Vielseitigkeit bekannt ist."
                    },
                    {
                        "type": "Debian",
                        "description": "Eine stabile und weit verbreitete Linux-Distribution, die als Grundlage für viele andere Distributionen dient."
                    },
                    {
                        "type": "Kali Linux",
                        "description": "Eine Linux-Distribution, die sich auf Penetrationstests und Sicherheitsaudits spezialisiert hat."
                    },
                    {
                        "type": "Raspberry Pi OS",
                        "description": "Ein von der Raspberry Pi Foundation entwickeltes Betriebssystem, das speziell für den Einsatz auf dem Raspberry Pi-Computer optimiert ist."
                    }
                ],
                "Anderes": [
                    {
                        "type": "Cisco IOS",
                        "description": "Das Betriebssystem, das auf Cisco-Netzwerkgeräten wie Routern und Switches läuft und die Netzwerkkonnektivität und -funktionen verwaltet."
                    }
                ]
            }
        },
        {
            "title": "Office-Software",
            "icon": "<i class=\"fa-brands fa-microsoft\"></i>",
            "description": "Ein tiefer Einblick in Microsoft Office und meine umfassende Kenntnis darin.",
            "createModal": true,
            "details": {
                "Microsoft Office": [
                    {
                        "type": "Microsoft Word",
                        "description": "Ein Textverarbeitungsprogramm zum Erstellen und Bearbeiten von Dokumenten aller Art."
                    },
                    {
                        "type": "Microsoft Excel",
                        "description": "Eine Tabellenkalkulationsanwendung zur Verwaltung von Daten, Erstellung von Diagrammen und Durchführung von Berechnungen."
                    },
                    {
                        "type": "Microsoft PowerPoint",
                        "description": "Eine Präsentationssoftware zum Erstellen und Bearbeiten von visuell ansprechenden Präsentationen."
                    },
                    {
                        "type": "Microsoft Access",
                        "description": "Eine Datenbankanwendung zur Verwaltung und Analyse großer Datenmengen."
                    },
                    {
                        "type": "Microsoft Outlook",
                        "description": "Eine E-Mail- und Organisationsanwendung zur Verwaltung von E-Mails, Terminen und Kontakten."
                    },
                    {
                        "type": "Microsoft Teams",
                        "description": "Eine Kommunikationsplattform für Teamarbeit, die Chat, Videoanrufe, Dateifreigabe und Zusammenarbeit in Echtzeit bietet."
                    },
                    {
                        "type": "Microsoft OneDrive",
                        "description": "Ein Cloud-Speicherdienst zur Speicherung, Synchronisierung und Freigabe von Dateien und Ordnern."
                    }
                ]
            }
        },
        {
            "title": "Programmierung",
            "icon": "<i class=\"fa-solid fa-file-code\"></i>",
            "description": "Die Bandbreite meiner Fähigkeiten in verschiedenen Programmiersprachen.",
            "createModal": true,
            "details": {
                "Script-Sprache": [
                    {
                        "type": "Microsoft PowerShell",
                        "description": "Eine von Microsoft entwickelte Befehlszeilen-Shell und Skriptsprache, die speziell für die Systemverwaltung und Automatisierung in Windows-Umgebungen konzipiert ist."
                    },
                    {
                        "type": "Linux Bash",
                        "description": "Die Bourne-Again-Shell (Bash) ist eine Standard-Shell für Unix-basierte Betriebssysteme wie Linux und macOS, die eine leistungsstarke Befehlszeilen-Schnittstelle und Skriptfähigkeiten bietet."
                    },
                    {
                        "type": "Python",
                        "description": "Eine vielseitige und benutzerfreundliche Programmiersprache, die für ihre Einfachheit, Lesbarkeit und umfangreiche Standardbibliothek bekannt ist. Python wird für verschiedene Anwendungsbereiche wie Webentwicklung, Datenanalyse, künstliche Intelligenz und Automatisierung eingesetzt."
                    }
                ],
                "Web-Entwicklung": [
                    {
                        "type": "HTML",
                        "description": "Die Hypertext Markup Language (HTML) ist eine Markup-Sprache zur Strukturierung von Webseiten und Inhalten im World Wide Web."
                    },
                    {
                        "type": "CSS",
                        "description": "Cascading Style Sheets (CSS) ist eine Stylesheet-Sprache zur Gestaltung des Erscheinungsbilds von HTML- und XML-Dokumenten."
                    },
                    {
                        "type": "JavaScript (einschließlich jQuery)",
                        "description": "Eine Programmiersprache, die häufig für die Entwicklung interaktiver Webseiten und Anwendungen verwendet wird. jQuery ist eine JavaScript-Bibliothek, die die Client-seitige Skriptprogrammierung vereinfacht."
                    },
                    {
                        "type": "PHP",
                        "description": "Eine serverseitige Skriptsprache, die hauptsächlich für die Entwicklung dynamischer Webseiten und Webanwendungen verwendet wird. PHP wird häufig mit MySQL oder anderen Datenbanken kombiniert."
                    }
                ],
                "Datenbank-Sprache": [
                    {
                        "type": "SQL",
                        "description": "Structured Query Language (SQL) ist eine spezielle Programmiersprache zur Verwaltung und Abfrage von relationalen Datenbanken. SQL wird für das Abrufen, Aktualisieren, Einfügen und Löschen von Daten verwendet."
                    }
                ]
            }
        },
        {
            "title": "Projektmanagement",
            "icon": "<i class=\"fa-solid fa-list-check\"></i>",
            "description": "Kernkonzepte und wichtige Aspekte, die das Projektmanagement ausmachen.",
            "createModal": true,
            "details": {
                "Essentielle Aspekte des Projektmanagements": [
                    {
                        "type": "Projektplanung",
                        "description": "Dies umfasst die Definition von Projektzielen, Umfang, Zeitplan, Ressourcenbedarf, Budget und Risiken. Die Erstellung eines detaillierten Projektplans ist entscheidend, um alle Projektphasen und Aufgaben zu identifizieren und zu organisieren."
                    },
                    {
                        "type": "Risikomanagement",
                        "description": "Die Identifizierung, Bewertung und Behandlung von Risiken, die den Projektverlauf und das Projektergebnis beeinflussen könnten. Dies beinhaltet die Entwicklung von Maßnahmen zur Risikominderung und -kontrolle."
                    },
                    {
                        "type": "Kommunikation",
                        "description": "Effektive Kommunikation ist entscheidend, um das Team, Stakeholder und andere Beteiligte über den Projektfortschritt, Änderungen, Probleme und Entscheidungen auf dem Laufenden zu halten. Dies umfasst regelmäßige Besprechungen, Statusberichte und andere Kommunikationsmittel."
                    },
                    {
                        "type": "Ressourcenmanagement",
                        "description": "Die Zuweisung und Verwaltung von Ressourcen wie Personal, Budget, Ausrüstung und Materialien, um sicherzustellen, dass das Projekt rechtzeitig und innerhalb des Budgets abgeschlossen wird."
                    },
                    {
                        "type": "Zeitmanagement",
                        "description": "Die Planung und Überwachung von Zeitplänen, um sicherzustellen, dass Projektziele und Meilensteine ​​rechtzeitig erreicht werden. Dies beinhaltet die Identifizierung von kritischen Pfaden und die Verwaltung von Zeitplanabweichungen."
                    },
                    {
                        "type": "Qualitätsmanagement",
                        "description": "Die Planung, Überwachung und Sicherstellung der Qualität von Projektprodukten und -ergebnissen gemäß den Anforderungen und Standards. Dies beinhaltet Qualitätskontrollen, Tests und Audits."
                    },
                    {
                        "type": "Stakeholdermanagement",
                        "description": "Die Identifizierung, Einbeziehung und Verwaltung der Interessen und Erwartungen aller Stakeholder, einschließlich Kunden, Teammitglieder, Lieferanten und anderen Beteiligten."
                    },
                    {
                        "type": "Änderungsmanagement",
                        "description": "Die Verwaltung von Änderungen im Projektumfang, Zeitplan oder Budget. Dies beinhaltet die Bewertung von Änderungsanforderungen, deren Genehmigung und Implementierung sowie die Kontrolle von Änderungen, um Auswirkungen auf das Projekt zu minimieren."
                    },
                    {
                        "type": "Teammanagement",
                        "description": "Die Führung, Motivation und Entwicklung des Projektteams, um eine effektive Zusammenarbeit und Leistung zu gewährleisten. Dies umfasst die Zuweisung von Aufgaben, das Coaching von Teammitgliedern und die Lösung von Konflikten."
                    },
                    {
                        "type": "Abschluss und Evaluierung",
                        "description": "Die Abschlussphase beinhaltet die Fertigstellung aller Projektaktivitäten, die Auslieferung der Endprodukte an den Kunden und die Durchführung einer Nachbereitung, um Erfahrungen zu reflektieren, Lernpunkte zu identifizieren und Best Practices für zukünftige Projekte zu dokumentieren."
                    }
                ],
                "Zusammenhang von Projektmanagement und JIRA": [
                    {
                        "type": "Beschreibung",
                        "description": "Diese Aspekte des Projektmanagements sind eng miteinander verbunden und müssen im Einklang stehen, um den Erfolg eines Projekts sicherzustellen. JIRA, ein Tool von Atlassian, wird oft in Verbindung mit agilen Methoden wie Scrum und Kanban verwendet, um Projektmanagement und Zusammenarbeit zu unterstützen."
                    }
                ]
            }
        },
        {
            "title": "IT-Netzwerk",
            "icon": "<i class=\"fa-solid fa-network-wired\"></i>",
            "description": "Expertise in Netzwerkplanung, -einrichtung und -wartung für zuverlässige Kommunikation.",
            "createModal": true,
            "details": {
                "Cisco Certified Network Associate 1 - CCNA1": [
                    {
                        "type": "Netzwerkgrundlagen",
                        "description": "Grundlagen von Netzwerken, ihre Architekturen, Topologien und Protokolle."
                    },
                    {
                        "type": "OSI-Modell und TCP/IP",
                        "description": "Verständnis des OSI-Schichtenmodells und des TCP/IP-Protokolls."
                    },
                    {
                        "type": "Netzwerkgeräte und -komponenten",
                        "description": "Funktionen und Konfiguration von Netzwerkgeräten wie Switches und Routern."
                    },
                    {
                        "type": "IP-Adressierung",
                        "description": "IPv4 und möglicherweise auch Einführung in IPv6, IP-Adressklassen, Subnetting und Adressierungsschemata."
                    },
                    {
                        "type": "Netzwerkprotokolle",
                        "description": "Grundlegende Netzwerkprotokolle wie ICMP, ARP, DHCP, DNS und deren Funktionsweise."
                    },
                    {
                        "type": "LAN (Local Area Network)",
                        "description": "Konfiguration und Management von LANs, Ethernet-Technologien, VLANs und deren Konfiguration."
                    },
                    {
                        "type": "WAN (Wide Area Network)",
                        "description": "Grundlagen von WANs, serielle Verbindungen, PPP und HDLC."
                    },
                    {
                        "type": "Netzwerk-Sicherheit",
                        "description": "Einführung in Netzwerksicherheitskonzepte, Authentifizierung, Verschlüsselung und grundlegende Sicherheitsmaßnahmen."
                    },
                    {
                        "type": "Netzwerkmanagement und -überwachung",
                        "description": "Grundlagen des Netzwerkmanagements, Konfigurations- und Überwachungstools, Fehlerbehebung und Diagnose."
                    },
                    {
                        "type": "Praktische Übungen und Labore",
                        "description": "Praktische Anwendung des erlernten Wissens durch Labors und Simulationen, um Konfigurationen durchzuführen und Netzwerke zu implementieren."
                    }
                ],
                "Cisco Certified Network Associate 2 - CCNA2": [
                    {
                        "type": "Routing und Switching",
                        "description": "Vertiefung der Konzepte von Routing und Switching, einschließlich der Konfiguration von Routern und Switches."
                    },
                    {
                        "type": "IPv4- und IPv6-Routing",
                        "description": "Weiterführende Kenntnisse über IPv4- und IPv6-Routing-Protokolle wie RIP, OSPF und EIGRP."
                    },
                    {
                        "type": "Spanning Tree Protocol (STP)",
                        "description": "Funktionsweise von STP und die Vermeidung von Schleifen in Netzwerktopologien."
                    },
                    {
                        "type": "VLANs und Inter-VLAN-Routing",
                        "description": "Vertiefte Konfiguration und Verwaltung von VLANs sowie die Umsetzung des Routings zwischen VLANs."
                    },
                    {
                        "type": "Access Control Lists (ACLs)",
                        "description": "Verwendung von ACLs zur Steuerung des Netzwerkzugriffs und der Sicherheit."
                    },
                    {
                        "type": "DHCP (Dynamic Host Configuration Protocol)",
                        "description": "Konfiguration und Verwaltung von DHCP für die automatische IP-Adresszuweisung."
                    },
                    {
                        "type": "Network Address Translation (NAT)",
                        "description": "Verständnis und Konfiguration von NAT zur Umsetzung von privaten IP-Adressen in öffentliche IP-Adressen."
                    },
                    {
                        "type": "WAN-Technologien",
                        "description": "Einführung in verschiedene WAN-Technologien wie HDLC, PPP, Frame Relay und möglicherweise auch VPNs."
                    },
                    {
                        "type": "Netzwerkdiagnose und -fehlerbehebung",
                        "description": "Weiterführende Fehlerbehebungstechniken und Diagnoseverfahren für Netzwerkprobleme."
                    }
                ],
                "Cisco Certified Network Associate 3 - CCNA3": [
                    {
                        "type": "Skalierbare Netzwerke",
                        "description": "Konzepte und Techniken zur Skalierung von Netzwerken, um größere und komplexere Umgebungen zu unterstützen."
                    },
                    {
                        "type": "VLANs und Trunking",
                        "description": "Vertiefte Konfiguration von VLANs und Trunking, einschließlich der Verwendung von VTP."
                    },
                    {
                        "type": "VLSM und IPv4-Adressierung",
                        "description": "Verstärktes Verständnis von Variable Length Subnet Masking (VLSM) und seiner Anwendung auf IPv4-Adressierungsschemata."
                    },
                    {
                        "type": "IPv6",
                        "description": "Fortgeschrittene Aspekte von IPv6, einschließlich Adressierung, Konfiguration und Integration in IPv4-Netzwerken."
                    },
                    {
                        "type": "Routing-Protokolle",
                        "description": "Vertiefte Kenntnisse und Konfiguration von Routing-Protokollen wie OSPF, EIGRP und möglicherweise auch BGP."
                    },
                    {
                        "type": "WAN-Technologien und Dienste",
                        "description": "Erweiterte Konfiguration von WAN-Technologien wie PPP, Frame Relay und möglicherweise auch MPLS."
                    },
                    {
                        "type": "Netzwerksicherheit",
                        "description": "Fortgeschrittene Sicherheitskonzepte und -techniken, einschließlich der Implementierung von ACLs, Sicherheit auf Routing-Ebene und Sicherung von Netzwerkgeräten."
                    },
                    {
                        "type": "Netzwerkmanagement und -überwachung",
                        "description": "Erweiterte Netzwerküberwachung, -verwaltung und -diagnose, einschließlich der Verwendung von SNMP und Syslog."
                    },
                    {
                        "type": "Troubleshooting-Konzepte",
                        "description": "Vertiefte Fähigkeiten zur Diagnose und Behebung von Netzwerkproblemen in komplexen Umgebungen."
                    }
                ]
            }
        },
        {
            "title": "IT-Sicherheit",
            "icon": "<i class=\"fa-solid fa-shield-halved\"></i>",
            "description": "Kompetenz in der Absicherung von IT-Netzwerken für geschützte Kommunikation.",
            "createModal": true,
            "details": {
                "Verschlüsselungsmethoden": [
                    {
                        "type": "Caesar- und Vigenère-Verschlüsselung",
                        "description": "Grundlagen historischer Verschlüsselungsmethoden zur Veranschaulichung kryptografischer Prinzipien."
                    },
                    {
                        "type": "Datenverschlüsselungstools",
                        "description": "Nutzung von Tools wie HexViewern, BitLocker und Microsoft EFS zur Dateiverschlüsselung und Sicherheit sensibler Daten."
                    },
                    {
                        "type": "E-Mail-Verschlüsselung",
                        "description": "Implementierung von End-to-End-Verschlüsselung (PGP, GPG) zur Sicherung der E-Mail-Kommunikation."
                    },
                    {
                        "type": "Symmetrische, asymmetrische und Hybrid-Verschlüsselung",
                        "description": "Verwendung von Verschlüsselungsverfahren zur Gewährleistung der Sicherheit von Datenübertragungen."
                    }
                ],
                "Sicherheitsmaßnahmen": [
                    {
                        "type": "Schlüsselaustauschverfahren",
                        "description": "Verständnis und Anwendung von Protokollen wie Diffie-Hellman für sichere Schlüsselübertragung."
                    },
                    {
                        "type": "Passwortspeicherung mit Hashes",
                        "description": "Verwendung von Hash-Algorithmen zur sicheren Passwortspeicherung."
                    },
                    {
                        "type": "Überprüfung von heruntergeladenen Programmen",
                        "description": "Verwendung von Hash-Prüfsummen zur Überprüfung der Integrität heruntergeladener Dateien."
                    },
                    {
                        "type": "Zertifikate und Zertifizierungsstellen (CAs)",
                        "description": "Nutzung von Zertifikaten und SSL/TLS-Handshake zur Authentifizierung und Verschlüsselung."
                    },
                    {
                        "type": "Integritätssicherung durch Hashing",
                        "description": "Nutzung von Hash-Algorithmen zur Überprüfung der Integrität von Daten."
                    }
                ],
                "Netzwerksicherheit": [
                    {
                        "type": "Windows Firewall und Linux iptables",
                        "description": "Einrichtung von Firewall-Regeln zur Netzwerksicherheit auf Windows und Linux."
                    },
                    {
                        "type": "Netzwerküberwachung und Auswertung",
                        "description": "Analyse von Netzwerkprotokollen und -paketen zur Erkennung von Sicherheitsproblemen."
                    },
                    {
                        "type": "Paketanalyse und Sniffer",
                        "description": "Verwendung von Packet Sniffers zur Überwachung und Analyse des Netzwerkverkehrs."
                    }
                ],
                "Sicherheitsrichtlinien und -management": [
                    {
                        "type": "Richtlinien und Risikomanagement",
                        "description": "Entwicklung und Implementierung von Sicherheitsrichtlinien und Risikomanagementverfahren."
                    },
                    {
                        "type": "Vertraulichkeit, Verfügbarkeit & Integrität",
                        "description": "Sicherstellung der Sicherheitsaspekte durch Einschränkung des Zugriffs, Verfügbarkeit und Integrität von Daten."
                    }
                ],
                "Angriffsprävention und -erkennung": [
                    {
                        "type": "Typen von Angreifern",
                        "description": "Identifikation verschiedener Angreifertypen und ihrer Ziele."
                    },
                    {
                        "type": "Aktivitäten der CIA-Triade",
                        "description": "Schutz der Vertraulichkeit, Integrität und Verfügbarkeit von Daten."
                    },
                    {
                        "type": "Datenschutz und gesetzgebende Tätigkeit",
                        "description": "Einhaltung von Datenschutzgesetzen und -vorschriften wie der DSGVO."
                    },
                    {
                        "type": "Anatomie eines Angriffs",
                        "description": "Identifizierung von Sicherheitslücken und Überwachung von Netzwerken."
                    },
                    {
                        "type": "Betriebssystem-Härtung (Lynis)",
                        "description": "Überprüfung von Betriebssystemen auf Sicherheitslücken und Empfehlungen zur Härtung."
                    },
                    {
                        "type": "Passwortknacken",
                        "description": "Methoden zur Identifizierung und Sicherung vor Passwortangriffen."
                    },
                    {
                        "type": "Digitale Zertifikate (für E-Mail)",
                        "description": "Verwendung von Zertifikaten zur Sicherung von E-Mail-Kommunikation."
                    },
                    {
                        "type": "Google Dorking",
                        "description": "Verwendung spezieller Suchbegriffe und -techniken zur Identifizierung von Schwachstellen und sensiblen Informationen über Suchmaschinen wie Google."
                    }
                ]
            }
        },
        {
            "title": "IT-Automatisierung",
            "icon": "<i class=\"fa-solid fa-robot\"></i>",
            "description": "Automatisierung von IT-Prozessen für Effizienz und Skalierbarkeit.",
            "createModal": true,
            "details": {
                "Automatisierungstools und Skriptsprachen": [
                    {
                        "type": "AutoHotKey",
                        "description": "Skripting-Tool für Windows zur Automatisierung von Maus- und Tastatureingaben; ermöglicht die Erstellung von Makros und Skripten für repetitive Aufgaben."
                    },
                    {
                        "type": "Automatisierte Bildverarbeitung",
                        "description": "Automatisierte Verarbeitung von Bildern durch Skripte oder Tools zur Größenänderung, Filteranwendung oder Stapelverarbeitung."
                    },
                    {
                        "type": "Batch-Umbenennung",
                        "description": "Automatisches Umbenennen von Dateien in großen Mengen über vordefinierte Regeln oder Muster."
                    },
                    {
                        "type": "Daten von externen Quellen",
                        "description": "Automatisierte Erfassung oder Integration von Daten aus externen Quellen wie APIs, Webseiten oder Datenbanken."
                    },
                    {
                        "type": "Microsoft Flow",
                        "description": "Tool von Microsoft zur Automatisierung von Workflows durch Verknüpfung verschiedener Apps und Dienste."
                    },
                    {
                        "type": "Reguläre Ausdrücke (RegEX)",
                        "description": "Mächtiges Werkzeug zur Verarbeitung und Suche von Texten basierend auf Mustern; ermöglicht die Identifizierung und Bearbeitung bestimmter Textmuster."
                    },
                    {
                        "type": "Linux-Shell-Scripting",
                        "description": "Verwendung von Befehlen und Skripten in der Linux-Shell (wie Bash) zur Automatisierung von Prozessen, Dateiverwaltung und Systemwartung."
                    },
                    {
                        "type": "Windows PowerShell",
                        "description": "Leistungsstarkes Framework und Befehlszeilenschnittstelle von Microsoft für die Automatisierung von Aufgaben und Systemverwaltung in Windows-basierten Systemen."
                    }
                ]
            }
        },
        {
            "title": "Datenbank",
            "icon": "<i class=\"fa-solid fa-database\"></i>",
            "description": "Effiziente Organisation und Sicherung von Datenbanken.",
            "createModal": true,
            "details": {
                "Datenbankverwaltung": [
                    {
                        "type": "Erstellung von Datenbanken und Relationen",
                        "description": "Einrichtung von Datenbanken und Definition von Beziehungen zwischen den verschiedenen Tabellen."
                    },
                    {
                        "type": "Modellierung von Datenbanken (MCD und MLD)",
                        "description": "Verwendung von Modellierungstechniken wie MCD und MLD für die Konzeption der Datenbankstruktur."
                    },
                    {
                        "type": "Arbeiten mit verschiedenen Datenbanktypen",
                        "description": "Kenntnisse und Erfahrung in der Verwaltung unterschiedlicher Datenbanktypen wie MySQL, MSSQL."
                    },
                    {
                        "type": "Datenbank-Backups",
                        "description": "Einrichtung und Planung von Backup-Strategien für Datenbanken."
                    },
                    {
                        "type": "SQL-Abfragen",
                        "description": "Erfahrung in der Verwendung von SQL zum Extrahieren, Aktualisieren, Löschen und Einfügen von Daten."
                    },
                    {
                        "type": "Verwaltung von Daten in Excel und Access",
                        "description": "Kenntnisse in der Verwaltung und Analyse von Daten in Excel und Access."
                    }
                ],
                "Daten-Formate": [
                    {
                        "type": "XML",
                        "description": "Extensible Markup Language (XML) ist eine Auszeichnungssprache zur Darstellung hierarchischer Strukturen in Form von Textdateien. Es wird häufig für den Austausch von Daten zwischen verschiedenen Systemen verwendet."
                    },
                    {
                        "type": "JSON",
                        "description": "JavaScript Object Notation (JSON) ist ein leicht lesbares Datenformat, das auf JavaScript-Objekten basiert. Es wird häufig für den Datenaustausch zwischen einem Server und einem Webclient verwendet."
                    },
                    {
                        "type": "CSV",
                        "description": "Comma-separated values (CSV) ist ein Dateiformat zur Darstellung tabellarischer Daten. Dabei werden die Datenzeilen durch Zeilenumbrüche getrennt und die einzelnen Felder in einer Zeile durch Kommas oder andere Trennzeichen voneinander abgegrenzt. "
                    }
                ]
            }
        },
        {
            "title": "Andere",
            "icon": "<i class=\"fa-solid fa-bars\"></i>",
            "description": "Ein Blick auf die Vielfalt der Tools und Technologien, mit denen ich vertraut bin.",
            "createModal": true,
            "details": {
                "Client": [
                    {
                        "type": "Visual Studio Code",
                        "description": "Ein plattformübergreifender Code-Editor mit Syntaxhervorhebung, IntelliSense und Git-Integration, der von Entwicklern für die Softwareentwicklung verwendet wird."
                    },
                    {
                        "type": "FTP Client",
                        "description": "Eine Softwareanwendung, die Benutzern ermöglicht, Dateien zwischen ihrem Computer und einem FTP-Server zu übertragen."
                    },
                    {
                        "type": "SSH Client",
                        "description": "Eine Softwareanwendung, mit der Benutzer eine sichere Verbindung zu einem SSH-Server herstellen können, um sich einzuloggen, Dateien zu übertragen und Befehle auszuführen."
                    },
                    {
                        "type": "Remote Desktop",
                        "description": "Ermöglicht Benutzern, eine Verbindung zu einem entfernten Computer herzustellen und diesen fernzusteuern, um auf Dateien, Anwendungen und Ressourcen zuzugreifen, als wären sie physisch vor dem entfernten Computer."
                    },
                    {
                        "type": "Cisco Packet Tracer",
                        "description": "Ein Netzwerksimulationstool von Cisco, das Benutzern ermöglicht, komplexe Netzwerke zu entwerfen, zu konfigurieren und zu testen, ohne physische Hardware zu benötigen."
                    }
                ],
                "Server": [
                    {
                        "type": "Apache2",
                        "description": "Ein weit verbreiteter Open-Source-Webserver für die Bereitstellung von Webinhalten im Internet."
                    },
                    {
                        "type": "Microsoft IIS",
                        "description": "Ein Webserver von Microsoft für Windows-Server, der Websites, Webanwendungen und andere Internetdienste hostet."
                    },
                    {
                        "type": "Active Directory",
                        "description": "Ein Verzeichnisdienst von Microsoft zur Verwaltung von Benutzern, Gruppen, Computern und Ressourcen in einer Windows-Domäne."
                    },
                    {
                        "type": "FTP Server",
                        "description": "Ein Server, der den Dateitransfer über das File Transfer Protocol (FTP) ermöglicht."
                    },
                    {
                        "type": "SSH Server",
                        "description": "Ein Server, der Secure Shell (SSH) unterstützt, um Benutzern eine sichere Remote-Verbindung zu ermöglichen und Befehle auszuführen."
                    }
                ],
                "Other": [
                    {
                        "type": "Wordpress (CMS)",
                        "description": "Eine benutzerfreundliche Plattform zur Erstellung und Verwaltung von Websites und Blogs mit zahlreichen Anpassungsmöglichkeiten durch Themes und Plugins."
                    }
                ]
            }
        }
    ]
}